simple/planeSymm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          44000;
        startFace       85780;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          44000;
        startFace       129780;
    }
    tankWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2200;
        startFace       173780;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       175980;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       176000;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       176020;
    }
)

// ************************************************************************* //
