simple/planeSymm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

l 550; // [mm] lenght of cone
R 5; // [mm] biggest radiuse of cone

vertices
(
    //block0 vertices
    (0 0 0) // 0
    (0 #eval{$R/3} 0) // 1
    (#eval{$R/3} #eval{$R/3} 0) // 2
    (#eval{$R/3} 0 0) // 3
    (0 0 $l) // 4
    (0 #eval{$R/3} $l) // 5
    (#eval{$R/3} #eval{$R/3} $l) // 6
    (#eval{$R/3} 0 $l) // 7

    //block1 new vertices
    (0 $R 0) // 8
    (#eval{$R/sqrt(2)} #eval{$R/sqrt(2)} 0) // 9
    (0 $R $l) // 10
    (#eval{$R/sqrt(2)} #eval{$R/sqrt(2)} $l) // 11

    //block2 new vertices
    ($R 0 0) // 12
    ($R 0 $l) // 13

);

xcells 5;
ycells 15;
zcells 1100;

stretch 0.5;

blocks
(
    //block0
    hex (0 3 2 1 4 7 6 5) ($xcells $xcells $zcells) simpleGrading (1 1 1)
    //block1
    hex (1 2 9 8 5 6 11 10)  ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
    //block2
    hex (2 3 12 9 6 7 13 11) ($xcells $ycells $zcells) simpleGrading (1 $stretch 1)
);

edges
(
    //block1 arc
    arc 8 9 (#eval{4 * $R / 5} #eval{3 * $R / 5} 0)
    arc 10 11 (#eval{4 * $R / 5} #eval{3 * $R / 5} $l)

    //block2 arc
    arc 12 9 (#eval{3 * $R / 5} #eval{4 * $R / 5} 0)
    arc 13 11 (#eval{3 * $R / 5} #eval{4 * $R / 5} $l)

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (1 8 9 2)
            (3 2 9 12)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
            (7 6 11 13)
        );
    }

    pipe
    {
        type wall;
        faces
        (
            (8 9 11 10)
            (9 12 13 11)
        );
    }

    symY
    {
        type symmetryPlane;

        faces
        (
            (0 1 5 4)
            (1 8 10 5)
        );
    }
    symX
    {
        type symmetryPlane;

        faces
        (
            (0 3 7 4)
            (3 12 13 7)
        );
    }

);

mergePatchPairs
(
);
